<!DOCTYPE HTML>
<html>
	<head>
	<title>Pr&aacute;ctica 3</title>
	</head>
	<body style="background-color:Bisque; color:chocolate;">
<a href="Practica 6.html">Indice de Pr&aacute;cticas</a>
<a name=indice></a> 
<h1 style="text-align:center; color:Chocolate;">Bases de datos</h1>
<h2>&Iacute;ndice</h2>
<ol>
	<li><a href="#Introducci&oacute;n">Introducci&oacute;n</a></li>
	<li><a href="#El modelo entidad-relaci&oacute;n">El modelo entidad-relaci&oacute;n</a></li>
	<li><a href="#Conceptos fundamentales">Conceptos fundamentales</a></li>
</ol>
<a name=Introducci&oacute;n></a>
<h2 style="color:Chocolate;">Introducci&oacute;n</h2> 
<p><blockquote><dfn>Una base de  datos es un  conjunto  de datos  estructurados,  almacenados en alg&uacute;n soporte  
de almacenamiento de datos y se puede acceder a ella desde  uno o varios  programas.</dfn></blockquote>
Antes de dise&ntilde;ar  una base de  datos se debe  establecer un proceso partiendo del mundo real, de manera que sea posible 
plasmar &eacute;ste mediante una serie de datos. La imagen que se obtiene del mundo real se denomina modelo conceptual y consiste en una serie de elementos que definen perfectamente 
lo que se quiere plasmar del mundo real en la base de datos.</p>

<p><em>El Sistema Gestor de Bases de Datos</em> <abbr>(SGBD)</abbr> es un conjunto de programas, procedimientos y 
lenguajes que proporcionan a los usuarios las herramientas necesarias para operar con una base 
de datos. Por tanto, el SGBD act&uacute;a como un intermediario entre los usuarios y los datos. Debe 
cumplir una serie de funciones como descripci&oacute;n de los datos, de manera que debe permitir 
definir los registros, sus campos, sus relaciones de autorizaci&oacute;n, etc. Debe manipular los 
datos permitiendo a los usuarios insertar, suprimir, modificar y consultar datos de la base 
de datos y por &uacute;ltimo, debe permitir usar la base de datos, dando un interfaz adecuado a cada
tipo de usuario.</p>

<p>Una vez que se ha explicado al motor de bases de datos la forma deseada para los datos, 
usando por ejemplo un entorno interactivo como es Access, el motor crear&aacute; algunos objetos 
f&iacute;sicos en los que guardar&aacute; los datos. El motor de base de datos es el encargado de realizar 
las consultas, altas, bajas, modificaciones, procedimientos, etc. de forma transparente al 
usuario. A la combinaci&oacute;n entre estructura y datos ser&aacute; a lo que nos referiremos como base de 
datos.</p> 
<hr/>
<a href="#indice"><img src="/home/luca/Escritorio/Practicas de HTML/Resources/introduccion.png"></a>

<a name="El modelo entidad-relaci&oacute;n"></a>
<h2 style="color:Chocolate;">El modelo entidad-relaci&oacute;n</h2>

<p>Es una t&eacute;cnica de dise&ntilde;o de bases de datos gr&aacute;fica, que incorpora informaci&oacute;n relativa a los datos 
y la relaci&oacute;n existente entre ellos, para poder as&iacute; plasmar una visi&oacute;n del mundo real sobre un 
soporte inform&aacute;tico. Sus caracter&iacute;sticas fundamentales son:</p>
<ul>
<li>Reflejan tan s&oacute;lo la existencia de los datos sin expresar lo que se hace con ellos.</li> 
<li>Es independiente de las bases de datos y de los sistemas operativos.</li>
<li>Incluye todos los datos que se estudian sin tener en cuenta las aplicaciones que se van a tratar.</li>  
</ul>
<p>Las entidades se representan como rect&aacute;ngulos, los atributos como elipses y las relaciones como 
rombos. El significado de estas palabras as&iacute; como de otras tambi&eacute;n importantes las vemos a 
continuaci&oacute;n.</p> 
<a href="#indice"><img src="/home/luca/Escritorio/Practicas de HTML/Resources/el modelo entidad-relacion.png"></a>

<a name="Conceptos fundamentales"></a>
<h3 style="color:Chocolate;">Conceptos fundamentales</h3>

<p><strong style="color:Chocolate;">Entidad:</strong> Una entidad es un objeto concreto o abstracto que presenta inter&eacute;s para el 
sistema y sobre el que se recoge informaci&oacute;n la cual va a ser representada en un sistema de 
base de datos. La mayor&iacute;a de las entidades modelan objetos o eventos del mundo real, por ejemplo,
 clientes, productos o llamadas de pedidos.</p>

<p><strong style="color:Chocolate;">Atributo:</strong> Es una unidad b&aacute;sica e indivisible de informaci&oacute;n acerca de una entidad o una 
relaci&oacute;n y sirve para identificar y describir a las mismas. Por ejemplo, si se va a modelar un 
evento como una llamada al servicio de asistencia, probablemente se querr&aacute; saber qui&eacute;n era el 
cliente, qui&eacute;n hizo la llamada y cu&aacute;ndo, as&iacute; como si se resolvi&oacute; o no el problema. La 
determinaci&oacute;n de los atributos que hay que incluir en el modelo es un problema sem&aacute;ntico (de 
significado). Se deben tomar decisiones basadas en el significado de los datos y en c&oacute;mo se 
utilizar&aacute;n.</p>
 
<p><strong style="color:Chocolate;">Dominio:</strong> Un dominio es el conjunto de valores que puede tomar cada uno de los atributos.</p>
<p>La mayor&iacute;a de las ocasiones se confunde dominio con tipo de datos, as&iacute; que vamos a ver un ejemplo
 que ponga de manifiesto la diferencia: si tomamos como atributo para una entidad persona su 
grupo sangu&iacute;neo, est&aacute; claro que el tipo de dato que tendremos que usar ser&aacute; de tipo cadena, sin 
embargo, los &uacute;nicos valores que puede tomar son los del conjunto {A+, A-, B+, B-, AB+, AB-, 0+, 
0-}; este ser&iacute;a el dominio del atributo grupo sangu&iacute;neo.</p>
<a href="#indice"><img src="/home/luca/Escritorio/Practicas de HTML/Resources/Conceptos fundamentales.jpg"></a>
	</body>
</html>